In [1]:
import pandas as pd
import numpy as np

In [2]:
sozlukVerisi={"İstabul":[30,29,np.nan],"Ankara":[20,np.nan,25],"İzmir":[40,39,38]}
havaDurumuDataFrame=pd.DataFrame(sozlukVerisi)

In [3]:
havaDurumuDataFrame

   İstabul  Ankara  İzmir
0     30.0    20.0     40
1     29.0     NaN     39
2      NaN    25.0     38

In [4]:
#olmayan verilerle başa çıkma: komple veriyi silebiliriz
havaDurumuDataFrame.dropna()
#boş veri olanları atar

   İstabul  Ankara  İzmir
0     30.0    20.0     40

In [5]:
havaDurumuDataFrame

   İstabul  Ankara  İzmir
0     30.0    20.0     40
1     29.0     NaN     39
2      NaN    25.0     38

In [6]:
havaDurumuDataFrame.dropna(axis=1) #kolonu getiriyoruz

   İzmir
0     40
1     39
2     38

In [7]:
yeniVeri={"İstabul":[30,29,np.nan],"Ankara":[20,np.nan,25],"İzmir":[40,39,38],"Antalya":[45,np.nan,np.nan]}
yeniDataFrame=pd.DataFrame(yeniVeri)

In [8]:
yeniDataFrame

   İstabul  Ankara  İzmir  Antalya
0     30.0    20.0     40     45.0
1     29.0     NaN     39      NaN
2      NaN    25.0     38      NaN

In [9]:
#thresh:limit koyma thresh=2 iki ve üzeri nan olanları atıyor antalya da 2 tane nan var
yeniDataFrame.dropna(axis=1,thresh=2)

   İstabul  Ankara  İzmir
0     30.0    20.0     40
1     29.0     NaN     39
2      NaN    25.0     38

In [10]:
yeniDataFrame

   İstabul  Ankara  İzmir  Antalya
0     30.0    20.0     40     45.0
1     29.0     NaN     39      NaN
2      NaN    25.0     38      NaN

In [11]:
#boş olanları doldurma
yeniDataFrame.fillna(20)

   İstabul  Ankara  İzmir  Antalya
0     30.0    20.0     40     45.0
1     29.0    20.0     39     20.0
2     20.0    25.0     38     20.0

# Gruplandırmak groupby

In [20]:
#sıraları grupluyor, herhangi bir kolondan gruplandırma yapıyor
maasSozlugu={"Departman" : ["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"],
             "Çalışan İsmi" : ["Ahmet","Mehmet","Burak","Atıl","Zeynep","Fatma"], 
             "Maaş" : [100,150,200,300,400,500]  
            }

In [21]:
maasDataFrame=pd.DataFrame(maasSozlugu)

In [22]:
maasDataFrame

   Departman Çalışan İsmi  Maaş
0    Yazılım        Ahmet   100
1    Yazılım       Mehmet   150
2  Pazarlama        Burak   200
3  Pazarlama         Atıl   300
4      Hukuk       Zeynep   400
5      Hukuk        Fatma   500

In [23]:
#1000 kişilik veri olduğunu düşünün bunun için groupby kullanacağız
maasDataFrame.groupby("Departman")

In [24]:
groupObjesi=maasDataFrame.groupby("Departman")

In [25]:
groupObjesi.count()#count saymak

           Çalışan İsmi  Maaş
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazılım               2     2

In [26]:
groupObjesi.mean() #maaşların ortalamasını alıyorlar

C:\Users\busra\AppData\Local\Temp\ipykernel_8040\232547061.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  groupObjesi.mean()

            Maaş
Departman
Hukuk      450.0
Pazarlama  250.0
Yazılım    125.0

In [27]:
groupObjesi.min()

          Çalışan İsmi  Maaş
Departman
Hukuk            Fatma   400
Pazarlama         Atıl   200
Yazılım          Ahmet   100

In [28]:
groupObjesi.max()

          Çalışan İsmi  Maaş
Departman
Hukuk           Zeynep   500
Pazarlama        Burak   300
Yazılım         Mehmet   150

In [29]:
groupObjesi.describe() #tüm özellikleri veriyor

           Maaş
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazılım     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0